{
    "content": "Savings plans\nSavings Plans are a powerful cost-saving feature designed to optimize your RunPod experience.\nTake advantage of upfront payments to unlock discounts on uninterrupted instances, maximize cost\neﬃciency, and get the most out of speciﬁc card types.\nGet started\nTo start saving with RunPod's Savings Plans, ensure you have suﬃcient RunPod credits in your\naccount.\nThere are two ways to create a savings plan.\nAdd a Savings Plan to your existing Pod from the Pod dashboard.\nInitiate a Savings Plan during Pod deployment.\nRegularly check the Savings Plans section to track your Savings Plans and associated pods.\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\nBeneﬁts\nReduced Costs: By paying upfront for a Savings Plan, you can enjoy discounted rates on\nuninterrupted instances. This means signiﬁcant cost savings for your RunPod deployments.\nFlexible Savings: When you stop a Pod, the Savings Plan associated with it applies to your next\ndeployment of the same card. This means you continue to beneﬁt from your savings commitment\neven after temporary pauses in your pod usage.\nWARNING\nStopping your Pod(s) does not extend your Savings Plan. Each Savings Plan has a ﬁxed\nexpiration date, which you set at when you buy the plan.\nInstant Activation: Savings Plans kick in immediately upon activation and remain active for the\nduration of your committed period. You can start saving from the moment you initiate a Savings\nPlan.\nEasy Management: Adding a Savings Plan to your existing running Pod is a breeze through the Pod\ndashboard. Alternately, Savings Plans are automatically started when you deploy a new Pod,\nsimplifying the process and ensuring you don't miss out on potential savings.\nClear Visibility: Stay on top of your savings commitments and associated Pods by navigating to the\nSavings Plan page. This shows a comprehensive overview of your Savings Plans for effective\nmonitoring and management.\nEmpower your RunPod deployments with Savings Plans and unlock the potential for cost\noptimization and enhanced savings. Begin maximizing your RunPod experience today!\nEdit this page\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\n"
}