{
    "content": "Hosting\nOverview\nOn this page\nOverview\nRunPod GPU Hosting Opportunity\nRunPod offers our clients a diverse range of GPUs, made possible through our proprietary\nservers and collaboration with trusted community members. If you're interested in integrating\nyour hardware into the RunPod ecosystem, follow the steps below.\nHow to Join as a Host:\n1. Check Eligibility: Make sure you adhere to our minimum requirements.\n2. Connect with us: Currently, we onboard hosts through a manual vetting process. If you have\nhigh-quality machines that satisfy our hosting requirements, and at least 20 GPUs in total,\nplease ﬁll out this form. Then, contact us on discord here.\nAdditional Hosting Information:\nService Fee: RunPod charges a 24% service fee. This encompasses:\nApproximately 4% for Stripe payment fees.\n2% for our referral program and 1% for our template program. (Learn more)\nPricing: While GPU on-demand prices are consistent, hosts can deﬁne a minimum bid price\nfor spot rental. Even though we try as much as possible to maintain stable prices over time,\nwe need to adjust to market trends.\nSafety & Trust: We mandate KYC (Know Your Customer) veriﬁcation for all hosts to\nsafeguard our users and combat fraud. For larger providers, we require a Provider\nAgreement and a Service Level Agreement to be completed.\nHosting Experience: As one of our trusted providers, you have access to a fully customized\ndashboard to manage your resources that you can leverage to deploy hardware and plan\nAsk AI\nAsk AI\nRunPod\nyour expansion.\nRental Rates: We do not make utilization data publicly available. However, we are more than\nhappy to provide statistics and information about popular GPU models when directly\ndiscussing with you. Furthermore, lots of different variables can impact occupancy. We are\nmore than happy to provide you with in-dept data about how different hardware quality\nlevels can impact your revenue.\nEdit this page\nPrevious\n« Manage Endpoints\nNext\nBurn Testing »\nDocs\nOverview\nTutorials\nAI APIs\nCommunity\nDiscord\nContact us\nMore\nBlog\nGitHub\nCopyright © 2024 RunPod\nAsk AI\nAsk AI\n"
}