{
    "content": "Secrets\nYou can add Secrets to your Pods and templates. Secrets are encrypted strings of text that are used\nto store sensitive information, such as passwords, API keys, and other sensitive data.\nCreate a Secret\nYou can create a Secret using the RunPod Web interface or the RunPod API.\n1. Login into the RunPod Web interface and select Secrets.\n2. Choose Create Secret and provide the following:\ni. Secret Name: The name of the Secret.\nii. Secret Value: The value of the Secret.\niii. Description: (optional) A description of the Secret.\n3. Select Create Secret.\nNOTE\nOnce a Secret is created, its value cannot be viewed. If you need to change the Secret, you\nmust create a new one or modify the Secret Value.\nModify a Secret\nYou can modify an existing Secret using the RunPod Web interface.\n1. Login into the RunPod Web interface and select Secrets.\n2. Select the name of the Secret you want to modify.\n3. Select the conﬁguration icon and choose Edit Secret Value.\ni. Enter your new Secret Value.\n4. Select Save Changes.\nView Secret details\nYou can view the details of an existing Secret using the RunPod Web interface. You can't view the\nSecret Value.\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\n1. Login into the RunPod Web interface and select Secrets.\n2. Select the name of the Secret you want to view.\n3. Select the conﬁguration icon and choose View Secret.\nUse a Secret in a Pod\nWith your Secrets setup, you can now reference them in your Pods.\nYou can reference your Secret directly or select it from the Web interface when creating or\nmodifying a Pod template.\nReference your Secret directly\nYou can reference your Secret directly in the Environment Variables section of your Pod template. To\nreference your Secret, reference it's key appended to the RUNPOD_SECRET_  preﬁx. For example:\nWhere hello_world  is the value of your Secret Name.\nSelect your Secret from the Web interface\nAlternatively, you can select your Secret from the Web interface when creating or modifying a Pod\ntemplate.\nDelete a Secret\nYou can delete an existing Secret using the RunPod Web interface.\n1. Login into the RunPod Web interface and select Secrets.\n2. Select the name of the Secret you want to delete.\n3. Select the conﬁguration icon and choose Delete Secret.\n4. Enter the name of the Secret to conﬁrm deletion.\n5. Select Conﬁrm Delete.\nEdit this page\n{{ RUNPOD_SECRET_hello_world }}\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\n"
}