{
    "content": "References\nTroubleshooting\n502 Errors\nOn this page\n502 Errors\n502 errors can occur when users attempt to access a program running on a speciﬁc port of a\ndeployed pod and the program isn't running or has encountered an error. This document\nprovides guidance to help you troubleshoot this error.\nCheck Your Pod's GPU\nThe ﬁrst step to troubleshooting a 502 error is to check whether your pod has a GPU attached.\n1. Access your pod's settings: Click on your pod's settings in the user interface to access\ndetailed information about your pod.\n2. Verify GPU attachment: Here, you should be able to see if your pod has a GPU attached. If it\ndoes not, you will need to attach a GPU.\nIf a GPU is attached, you will see it under the Pods screen (e.g. 1 x A6000). If a GPU is not\nattached, this number will be 0. RunPod does allow you to spin up a pod with 0 GPUs so that you\ncan connect to it via a Terminal or CloudSync to access data. However, the options to connect to\nRunPod via the web interface will be nonfunctional, even if they are lit up.\nCheck Your Pod's Logs\nAfter conﬁrming that your pod has a GPU attached, the next step is to check your pod's logs for\nany errors.\n1. Access your pod's logs: You can view the logs from the pod's settings in the user interface.\nAsk AI\nAsk AI\nRunPod\n2. \nLook for errors: Browse through the logs to ﬁnd any error messages that may provide clues\nabout why you're experiencing a 502 error.\nVerify Additional Steps for Oﬃcial Templates\nIn some cases, for our oﬃcial templates, the user interface does not work right away and may\nrequire additional steps to be performed by the user.\n1. Access the template's ReadMe: Navigate to the template's page and open the ReadMe ﬁle.\n2. Follow additional steps: The ReadMe ﬁle should provide instructions on any additional\nsteps you need to perform to get the UI functioning properly. Make sure to follow these\ninstructions closely.\nRemember, each template may have unique requirements or steps for setup. It is always\nrecommended to thoroughly review the documentation associated with each template.\nIf you continue to experience 502 errors after following these steps, please contact our support\nteam. We're here to help ensure that your experience on our platform is as seamless as possible.\nEdit this page\nPrevious\n« Troubleshooting\nNext\nFAQ »\nDocs\nOverview\nTutorials\nAsk AI\nAsk AI\nAI APIs\nCommunity\nDiscord\nContact us\nMore\nBlog\nGitHub\nCopyright © 2024 RunPod\nAsk AI\nAsk AI\n"
}