{
    "content": "Manage accounts\nYou will need to create an account or get invited by a team member to use RunPod.\nCreate an account\nSign up for an account at RunPod.io.\nConvert personal account to a team account\nYou can convert a personal account to a team account at anytime.\n1. From the console, select Convert to Team Account.\n2. Set a team name and conﬁrm the conversion.\nGet invited by a team member\n1. Accept the link sent by a team member.\n2. Select Join Team.\nFor information on how to send an invitation, see Invite a user.\nInvite a user\nTo invite a user to your team on RunPod, you'll need a team account.\n1. To invite users, navigate to your Team page, and select the \"Invite New Member\" button at the\ntop of the \"Members\" section.\n2. Select the role you want to provide the user.\n3. After you create the invite, you can copy the invite link from the pending invites section.\n4. Send a user your invite link and they will be able to go to it to join your team.\nRole types\nThe following roles and permissions are available to you:\nBasic role\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\nLimited access, primarily for account usage and existing pod connections.\nPermissions:\nUse the account.\nConnect to and use Pods.\nRestricted from viewing billing information.\nNo permissions to start, stop, or create Pods.\nBilling role\nSpecialized role focused on managing billing aspects. Permissions:\nAccess and manage billing information.\nRestricted from other account features and Pod management.\nDev role\nEnhanced privileges suitable for development tasks.\nPermissions:\nAll \"Basic\" role permissions (use account, connect to Pods).\nStart, stop, and create Pods.\nNo access to billing information.\nAdmin role\nFull control over the account, ideal for administrators.\nPermissions:\nComplete access to all account features and settings.\nManage billing and access billing information.\nStart, stop, and create Pods.\nModify account settings and user permissions.\nFull control over all account resources and users.\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\nEdit this page\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\n"
}