{
    "content": "Hosting\nMaintenance and reliability\nOn this page\nMaintenance and reliability\nMaintenance\nHosts must currently schedule maintenance at least one week in advance and are able to\nprogram ﬂash maintenance in the case their server is unrented. Users will get email reminders of\nupcoming maintenance that will occur on their active pods. Please contact RunPod on Discord\nor Slack if you are scheduling maintenance on more than a few machines so that we are aware\nof any major impacts to our customers.\nHere are some things to keep in mind.\nUptime/reliability will not be affected during scheduled maintenance.\nALL other events that may impact customer workloads will result in a reliability score\ndecrease. This includes unlisted machines.\nAll machines that have maintenance scheduled will be automatically unlisted 4 days prior to\nthe scheduled maintenance start time to minimize disruption for clients.\nExcessive maintenance will result in further penalties.\nYou are allowed to bring down machines that have active users on them provided that you\nare in a maintenance window.\nReliability calculations\nRunPod aims to partner with datacenters that offer 99.99% uptime. Reliability is currently\ncalculated as follows:\n$( total minutes + small buffer ) / total minutes in interval$\nThis means that if you have 30 minutes of network downtime on the ﬁrst of the month, your\nreliability will be calculated as:\n$( 43200 - 30 + 10 ) / 43200 = 99.95%$\nAsk AI\nAsk AI\nRunPod\nBased on approximately 43200 minutes per month and a 10 minute buffer. We include the buffer\nbecause we do incur small single-minute uptime dings once in a while due to agent upgrades\nand such. It will take an entire month to regenerate back to 100% uptime given no further\ndowntimes in the month, considering it it calculated based on a 30 days rolling window.\nMachines with less than 98% reliability are automatically removed from the available GPU pool\nand can only be accessed by clients that already had their data on it.\nEdit this page\nPrevious\n« Burn Testing\nNext\nRequirements »\nDocs\nOverview\nTutorials\nAI APIs\nCommunity\nDiscord\nContact us\nMore\nBlog\nGitHub\nCopyright © 2024 RunPod\nAsk AI\nAsk AI\n"
}