{
    "content": "Use SSH\nThe basic terminal SSH access that RunPod exposes is not a full SSH connection and, therefore, does not support commands like SCP. If you want to ha\nSetup\n1. Generate your public/private SSH key pair on your local machine with ssh-keygen -t ed25519 -C \"your_email@example.com\" . This will save\nNOTE\nif you're using command prompt in Windows rather than the Linux terminal or WSL, your public/private key pair will be saved to C:\\users\\{you\n2. Add your public key to your RunPod user settings.\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\n3. Start your Pod. Make sure of the following things:\nYour Pod supports a public IP, if you're deploying in Community Cloud.\nAn SSH daemon is started. If you're using a RunPod oﬃcial template such as RunPod Stable Diffusion, you don't need to take any additional steps. I\nan existing start command, replace sleep infinity  at the end with your existing command:\nbash -c 'apt update;DEBIAN_FRONTEND=noninteractive apt-get install openssh-server -y;mkdir -p ~/.ssh;cd $_;chmod 700\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\nOnce your Pod is done initializing, you'll be able to SSH into it by running the SSH over exposed TCP command in the Pod's Connection Options menu on\nNOTE\nif you're using the Windows Command Prompt rather than the Linux terminal or WSL, and you've used the default key location when generating y\nSSH command after the -i  ﬂag to C:\\users\\{yourUserAccount}\\.ssh\\id_ed25519 .\nIf you've saved your key to a location other than the default, specify that path you chose when generating your key pair after the -i  ﬂag instead.\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\nWhat's the SSH password?\nIf you're being prompted for a password when you attempt to connect, something is amiss. We don't require a password for SSH connections. Some com\nCopying and pasting the key ﬁngerprint (beginning with SHA256: ) into your RunPod user settings instead of the public key itself (the contents of the\nOmitting the encryption type from the beginning of the key when copying and pasting into your RunPod user settings (i.e., copying the random text, \nNot separating different public keys in your RunPod user settings with a newline between each one (this would result in the ﬁrst public/private key p\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\nSpecifying an incorrect ﬁle path to your private key ﬁle:\nAttempting to use a private key that other users on the machine have permissions for:\nEdit this page\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\n"
}