{
    "content": "Create a network volume\nNetwork Volumes are a feature speciﬁc to Secure Cloud that allows you to create a volume that\nmultiple pods can interact with. This gives you an extra amount of ﬂexibility to keep working--\nespecially if you are working with a high demand GPU pool that may not always be available--as you\ncan simply create a pod in a different pool while you wait for an option to free up. This can also save\nyou time by downloading frequently used models or other large ﬁles to a volume and holding them\nfor later use, rather than having to re-download them every time you spin up a new pod.\nHow to Create a Volume\nUnder the Secure Cloud page, click the option to create a volume.\nThe pricing for the volume will be shown, and you can select a data center and provide a name and\nthe requested size.\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\nOnce you create the volume, it will appear in your list.\nOnce you click the Deploy option, your container size will be locked to the size of your network\nvolume. Note that there will be a nominal cost for network volume storage, in lieu of the disk cost\nnormally quoted. Also note that you can link many pods to one singular network volume, and you\nwill enjoy an overall cost saving even with just two pods sharing one volume (as opposed to setting\nup two pods with separate volumes), despite the presence of this additional cost.\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\nWhat's the infrastructure behind Network Volume\nWhen you choose to create a Network Volume, you gain access to our robust infrastructure, which\nincludes state-of-the-art storage servers located in the same datacenters where you rent GPU\nservers from us. These servers are connected via a high-speed 25Gbps local network, up to\n200Gbps in some locations, guaranteeing eﬃcient data transfer and minimal latency. Everything is\nstored on high-speed NVME SSDs to ensure best performance.\nIf you're interested in harnessing the advantages of Network Volume and its cost-effective storage\nsolutions, we invite you to read our detailed blog article. It explores the beneﬁts and features of\nNetwork Volume, helping you make an informed decision about your storage needs.\nPlease note that if your machine-based storage or network volume is terminated due to lack of\nfunds, that disk space is immediately freed up for use by other clients, and RunPod is unable to\nassist in recovering lost storage.\nEdit this page\nConvert web pages and HTML files to PDF in your applications with the Pdfcrowd HTML to PDF API\nPrinted with Pdfcrowd.com\n"
}