{
    "content": "References\nFAQ\nManage Payment Card Declines\nManage Payment Card Declines\nRunPod is a US-based organization that serves clients all across the world. However, credit card\nprocessors have in general keyed into international transactions as a potential vector for fraud\nand tend to apply more stringent standards for blocking transactions. If your card is declined,\ndon't panic! To minimize potential interruptions to your service, you'll want to follow these steps.\nKeep your balance topped up\nTo avoid any potential issues with your balance being overrun, it's best to refresh your balance at\nleast a few days before you're due to run out so you have a chance to address any last minute\ndelays. Also be aware that there is an option to automatically refresh your balance when you run\nlow under the Billing page:\nCall the bank that issued your card\nOnce you do experience a card decline, the ﬁrst step you'll want to do is to contact your issuing\nbank to see why a card is declined. Due to consumer/merchant privacy standards in the US, we\nare not provided with a reason that the card is declined, only that the transaction was not\nprocessed. Only your issuing bank can speciﬁcally tell you why a payment was declined. Many\ntimes, declines are for completely innocent reasons, such as your bank's anti-fraud protection\ntripping; just the same, RunPod is unable to assist with blocks put in place by your bank.\nIt's important that you call your bank for the initial decline before trying a different card, because\nthe processor may block all funding attempts from an account if it seems declines from multiple\ncards for the same account, even if these attempts would have otherwise not had any problems.\nAsk AI\nAsk AI\nRunPod\nThese account blocks generally clear after 24 hours, but it may be diﬃcult to load the account\nuntil then.\nOther potential reasons for card blocks\nOur payment processor may block cards for speciﬁc users based on their risk proﬁle, so certain\nuse patterns may trigger a block. If you use several different cards within a short period time, or\nhave had disputed transactions in the past, this may also cause cards to decline.\nTo see a list of supported cards on Stripe, click here.\nContact us for support\nIf all else fails, then feel free to contact RunPod support if you are still having trouble loading\nyour account. We ask that you check with your bank ﬁrst, but if everything checks out on your\nend, we will be glad to help!\nEdit this page\nPrevious\n« FAQ\nNext\nGPU types »\nDocs\nOverview\nTutorials\nAI APIs\nCommunity\nDiscord\nContact us\nMore\nAsk AI\nAsk AI\nBlog\nGitHub\nCopyright © 2024 RunPod\nAsk AI\nAsk AI\n"
}